#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/orga_vis/snowflake_project_workspace_TEST/runs/run-ZJgKuFQzCe9fFPxm

Waiting for the plan to start...

Terraform v1.11.0
on linux_amd64
Initializing plugins and modules...
snowflake_account_role.role: Refreshing state... [id=TEST_POC_VISEO_ROLE]
snowflake_grant_account_role.rolegrant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|ROLE|"SYSADMIN"]
snowflake_grant_account_role.grants: Refreshing state... [id="TEST_POC_VISEO_ROLE"|USER|"ADMIN_USER"]
snowflake_grant_privileges_to_account_role.executetask: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|MONITOR EXECUTION,EXECUTE TASK,EXECUTE MANAGED TASK|OnAccount]
snowflake_database.db: Refreshing state... [id=TEST_POC_VISEO_DB]
snowflake_warehouse.warehouse: Refreshing state... [id=TEST_WH]
snowflake_grant_privileges_to_account_role.warehouse_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|USAGE|OnAccountObject|WAREHOUSE|"TEST_WH"]
snowflake_grant_privileges_to_account_role.future_tables_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|INSERT,SELECT|OnSchemaObject|OnFuture|TABLES|InDatabase|"TEST_POC_VISEO_DB"]
snowflake_grant_privileges_to_account_role.database_grant: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE SCHEMA,MODIFY,USAGE,MONITOR|OnAccountObject|DATABASE|"TEST_POC_VISEO_DB"]
snowflake_schema.monitoring_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."MONITORING_LAYER"]
snowflake_schema.gold_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."GOLD_LAYER"]
snowflake_schema.bronze_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_schema.raw_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_schema.silver_layer: Refreshing state... [id="TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_monitoring: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."MONITORING_LAYER"]
snowflake_table.change_history_table: Refreshing state... [id=TEST_POC_VISEO_DB|MONITORING_LAYER|CHANGE_HISTORY]
snowflake_grant_privileges_to_account_role.schema_grant_raw: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE EXTERNAL TABLE,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."RAW_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_silver: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."SILVER_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_bronze: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE SEQUENCE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."BRONZE_LAYER"]
snowflake_grant_privileges_to_account_role.schema_grant_gold: Refreshing state... [id="TEST_POC_VISEO_ROLE"|false|false|CREATE TASK,CREATE STREAM,CREATE PROCEDURE,CREATE FILE FORMAT,CREATE TABLE,CREATE VIEW,CREATE STAGE,CREATE PIPE,CREATE NOTEBOOK,USAGE|OnSchema|OnSchema|"TEST_POC_VISEO_DB"."GOLD_LAYER"]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # snowflake_grant_privileges_to_account_role.schema_grant_orchestration will be created
  + resource "snowflake_grant_privileges_to_account_role" "schema_grant_orchestration" {
      + account_role_name = "TEST_POC_VISEO_ROLE"
      + all_privileges    = false
      + always_apply      = false
      + id                = (known after apply)
      + on_account        = false
      + privileges        = [
          + "CREATE FILE FORMAT",
          + "CREATE NOTEBOOK",
          + "CREATE PIPE",
          + "CREATE PROCEDURE",
          + "CREATE SEQUENCE",
          + "CREATE STAGE",
          + "CREATE STREAM",
          + "CREATE TABLE",
          + "CREATE TASK",
          + "CREATE VIEW",
          + "USAGE",
        ]
      + with_grant_option = false

      + on_schema {
          + schema_name = "\"TEST_POC_VISEO_DB\".\"ORCHESTRATION_SCHEMA\""
        }
    }

  # snowflake_schema.orchestration_schema will be created
  + resource "snowflake_schema" "orchestration_schema" {
      + catalog                                       = (known after apply)
      + data_retention_time_in_days                   = (known after apply)
      + database                                      = "TEST_POC_VISEO_DB"
      + default_ddl_collation                         = (known after apply)
      + describe_output                               = (known after apply)
      + enable_console_output                         = (known after apply)
      + external_volume                               = (known after apply)
      + fully_qualified_name                          = (known after apply)
      + id                                            = (known after apply)
      + is_transient                                  = "default"
      + log_level                                     = (known after apply)
      + max_data_extension_time_in_days               = (known after apply)
      + name                                          = "ORCHESTRATION_SCHEMA"
      + parameters                                    = (known after apply)
      + pipe_execution_paused                         = (known after apply)
      + quoted_identifiers_ignore_case                = (known after apply)
      + replace_invalid_characters                    = (known after apply)
      + show_output                                   = (known after apply)
      + storage_serialization_policy                  = (known after apply)
      + suspend_task_after_num_failures               = (known after apply)
      + task_auto_retry_attempts                      = (known after apply)
      + trace_level                                   = (known after apply)
      + user_task_managed_initial_warehouse_size      = (known after apply)
      + user_task_minimum_trigger_interval_in_seconds = (known after apply)
      + user_task_timeout_ms                          = (known after apply)
      + with_managed_access                           = "false"
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @MatthieuDN, Action: `pull_request`, Working Directory: ``, Workflow: `CI`*